<?php
/**
 * 生成书籍相关数据的测试数据
 * Created by PhpStorm.
 * User: yifang
 * Email：2424004764@qq.com
 * Date: 2020/10/24 0024
 * Time: 17:46
 */

namespace app\common\test;

class generateTestData
{

    private $data = null; // 字符串数据
    private $dataLength = 0; // 字符串数据的长度
    private $images = ["http://cdn.fologde.com/3.png.jpeg", "http://cdn.fologde.com/2017-08-28-16-11-03JIANCHI.png",
        "http://cdn.fologde.com/2017-08-28-16-42-34JIANCHI.png", "http://cdn.fologde.com/2017-08-28-17-04-33JIANCHI.png",
        "http://cdn.fologde.com/2017-08-28-17-39-14JIANCHI.png", "http://cdn.fologde.com/2017-08-28-17-52-33JIANCHI.png",
        "http://cdn.fologde.com/2017-08-28-18-00-29JIANCHI.png", "http://cdn.fologde.com/2017-08-28-18-05-07JIANCHI.png",
        "http://cdn.fologde.com/2017-08-28-18-12-27JIANCHI.png", "http://cdn.fologde.com/2017-08-28-18-35-55JIANCHI.png",
        "http://cdn.fologde.com/2017-08-28-18-41-23JIANCHI.png", "http://cdn.fologde.com/2017-08-28-20-30-40JIANCHI.png",
        'http://cdn.fologde.com/2017-08-28-20-31-42JIANCHI.png', 'http://cdn.fologde.com/2017-08-29-16-47-05JIANCHI.png',
        'http://cdn.fologde.com/2017-08-29-17-41-37JIANCHI.png', 'http://cdn.fologde.com/2017-08-29-17-45-00JIANCHI.png',
        'http://cdn.fologde.com/2017-08-29-17-51-01JIANCHI.png', 'http://cdn.fologde.com/2017-08-29-18-32-13JIANCHI.png',
        'http://cdn.fologde.com/2017-08-29-21-15-33JIANCHI.png', 'http://cdn.fologde.com/2017-08-29-21-21-07JIANCHI.png',
        'http://cdn.fologde.com/2017-08-29-21-50-23JIANCHI.png', 'http://cdn.fologde.com/2017-08-30-10-21-17JIANCHI.png',
        'http://cdn.fologde.com/2017-08-30-10-22-34JIANCHI.png', 'http://cdn.fologde.com/2017-08-30-13-41-05JIANCHI.png',
    ]; // 测试图片数据

    public function __construct()
    {
        $this->data = $this->getGenerateTestData();
        $this->dataLength = count($this->data);
    }

    /**
     * 单个字数组数据
     * @return string[]
     */
    public function getGenerateTestData()
    {
        return array(
            "海", "南", "省", "气", "象", "台", "日", "继", "续", "发", "布", "台", "风", "三", "级", "预", "警",
            "受", "台", "风", "影", "响", "取", "消", "航", "班", "共", "白", "云", "山", "板", "蓝", "根", "对", "新", "冠", "病", "毒", "有", "效",
            "我", "家", "里", "面", "有", "很", "多", "板", "蓝", "根", "汕", "头", "消", "防", "通", "报", "南", "澳",
            "森", "林", "火", "灾", "现", "场", "正", "全", "力", "扑", "救", "附", "近", "村", "民", "已", "紧", "急", "疏", "散",
            "偶", "然", "机", "会", "的", "拜", "读", "。", "所", "谓", "三", "板", "斧", "，", "是", "基", "于", "基",
            "层", "管", "理", "者", "、", "中", "层", "管", "理", "者", "、", "高", "层", "管", "理", "者", "的", "目",
            "标", "定", "位", "来", "写", "书", "中", "有", "左", "右", "的", "观", "点", "可", "以", "借", "鉴", "而",
            "其", "他", "观", "点", "不", "敢", "苟", "同", "互", "联", "网", "时", "代", "人", "不", "是", "机", "器",
            "而", "是", "要", "多", "考", "虑", "人", "性", "目", "标", "导", "向", "人", "际", "关", "系", "二", "者", "都", "要", "抓",
            "有", "一", "些", "比", "较", "推", "荐", "的", "简", "短", "言", "论", "吧", "。", "比", "如", "说", "执",
            "行", "才", "能", "检", "验", "，", "唐", "僧", "也", "是", "在", "取", "经", "途", "中", "才", "遇", "到",
            "孙", "悟", "空", "猪", "八", "戒", "沙", "僧", "的", "。", "做", "事", "情", "不", "想", "回", "报", "叫",
            "付", "出", "，", "想", "回", "报", "叫", "投", "资", "。", "生", "活", "中", "太", "多", "的", "投", "资",
            "了", "，", "可", "是", "对", "于", "初", "创", "企", "业", "需", "要", "的", "更", "多", "是", "付", "出",
            "。", "文", "中", "有", "一", "段", "讲", "冥", "想", "的", "意", "义", "，", "我", "在", "实", "际", "工",
            "作", "中", "有", "所", "尝", "试", "。", "组", "织", "团", "队", "内", "多", "人", "进", "行", "冥", "想",
            "，", "回", "顾", "自", "己", "入", "职", "以", "来", "给", "团", "队", "做", "出", "什", "么", "贡", "献",
            "，", "自", "己", "有", "什", "么", "反", "思", "。", "经", "过", "冥", "想", "，", "确", "实", "发", "现",
            "了", "自", "己", "在", "团", "队", "管", "理", "中", "之", "前", "有", "所", "缺", "失", "的", "部", "分",
            "，", "也", "能", "够", "更", "好", "的", "c", "a", "r", "e", "整", "个", "团", "队", "的", "近", "况", "，",
            "代", "价", "仅", "仅", "是", "1", "-", "2", "个", "小", "时", "的", "会", "议", "。", "书", "读", "了", "一",
            "半", "，", "等", "读", "完", "再", "做", "更", "深", "层", "次", "的", "评", "论", "。",
            "在", "读", "这", "本", "书", "的", "时", "候", "我", "同", "样", "在", "读", "冯", "仑", "的", "岁", "月",
            "凶", "猛", "怎", "么", "说", "冯", "仑", "一", "个", "是", "企", "业", "家", "，", "而", "这", "本", "书",
            "的", "作", "者", "更", "像", "是", "一", "个", "是", "一", "线", "操", "作", "工", "举", "例", "各", "种",
            "风", "投", "项", "目", "模", "拟", "一", "线", "操", "作", "工", "无", "非", "告", "诉", "你", "我", "们",
            "是", "怎", "么", "做", "的", "，", "公", "司", "的", "制", "度", "怎", "么", "牛", "，", "说", "完", "之",
            "后", "还", "顺", "带", "把", "自", "己", "带", "入", "里", "面", "的", "角", "色", "，", "你", "看", "看",
            "我", "，", "这", "样", "是", "不", "是", "很", "厉", "害", "作", "品", "如", "人", "我", "相", "信", "这",
            "个", "作", "者", "尽", "管", "顶", "着", "阿", "里", "巴", "巴", "的", "光", "环", "却", "不", "过", "像",
            "是", "商", "店", "里", "换", "季", "的", "新", "品", "没", "有", "任", "何", "保", "留", "的", "价", "值",
            "过", "完", "这", "季", "只", "能", "甩", "了", "这", "种", "书", "食", "之", "无", "味", "。",
            "我", "的", "团", "队", "有", "些", "成", "员", "我", "可", "以", "直", "接", "骂", "他", "他", "还", "很",
            "感", "激", "我", "有", "些", "成", "员", "就", "算", "犯", "了", "很", "严", "重", "的", "错", "误", "我",
            "也", "得", "客", "客", "气", "气", "的", "绕", "着", "弯", "子", "提", "出", "来", "对", "待", "不", "同",
            "的", "成", "员", "方", "法", "肯", "定", "是", "不", "同", "的", "就", "拿", "骂", "人", "的", "例", "子",
            "来", "说", "有", "些", "人", "可", "能", "只", "看", "到", "我", "骂", "他", "没", "看", "到", "我", "最",
            "下", "功", "夫", "的", "就", "是", "他", "和", "他", "无", "数", "次", "谈", "心", "给", "他", "无", "数",
            "次", "帮", "助", "建", "立", "了", "深", "厚", "的", "信", "任", "和", "友", "谊", "加", "上", "这", "次",
            "犯", "的", "错", "误", "又", "是", "屡", "犯", "的", "所", "以", "骂", "他", "也", "心", "服", "口", "服",
            "阿", "里", "巴", "巴", "之", "所", "以", "多", "年", "来", "稳", "健", "高", "速", "发", "展", "源", "于",
            "其", "有", "着", "系", "统", "的", "组", "织", "和", "文", "化", "传", "承", "的", "模", "式", "与", "许",
            "多", "搭", "建", "宏", "大", "理", "论", "体", "系", "的", "管", "理", "书", "籍", "不", "同", "这", "本",
            "阿", "里", "三", "板", "斧", "是", "实", "打", "实", "的", "实", "战", "复", "盘", "这", "套", "管", "理",
            "原", "则", "和", "方", "法", "伴", "随", "阿", "里", "巴", "巴", "集", "团", "从", "几", "十", "人", "走",
            "到", "几", "万", "人", "可", "见", "其", "强", "大", "的", "生", "命", "力", "学", "习", "《", "阿", "里",
            "三", "板", "斧", "》", "不", "仅", "有", "利", "于", "提", "升", "个", "人", "竞", "争", "力", "团", "队",
            "战", "斗", "力", "也", "会", "让", "管", "理", "从", "实", "践", "上", "升", "到", "哲", "学",
            "阿", "里", "巴", "巴", "把", "管", "理", "分", "为", "三", "个", "层", "级", "基", "层", "管", "理", "者",
            "中", "层", "管", "理", "者", "高", "层", "管", "理", "者", "不", "同", "层", "级", "的", "管", "者", "者",
            "有", "不", "同", "的", "指", "标", "基", "层", "管", "理", "者", "的", "指", "标", "是", "定", "目", "标",
            "追", "过", "程", "拿", "结", "果", "事", "中", "层", "管", "理", "者", "的", "指", "标", "是", "f", "i", "r",
            "e", "a", "n", "d", "h", "i", "r", "e", "t", "e", "a", "m", "b", "u", "i", "l", "d", "i", "n", "g", "和", "g",
            "e", "t", "r", "e", "s", "u", "l", "t", "人", "和", "事", "高", "层", "管", "理", "者", "的", "指", "标", "是",
            "揪", "头", "发", "眼", "界", "照", "镜", "子", "闻", "味", "道", "预", "判", "在", "实", "施", "三", "板", "斧",
            "培", "训", "过", "程", "中", "基", "层", "管", "理", "者", "要", "落", "实", "以", "下", "事", "情", "一", "定",
            "目", "标", "确", "定", "三", "天", "后", "的", "团", "队", "目", "标", "项", "目", "计", "划", "书", "需", "要",
            "的", "模", "块", "每", "晚", "进", "行", "2", "7", "1", "排", "序", "二", "追", "过", "程", "明", "确", "分",
            "工", "追", "踪", "细", "节", "和", "过", "程", "拿", "结", "果", "每", "个", "阶", "段", "都", "要", "出", "成",
            "果", "每", "天", "实", "施", "六", "点", "工", "作", "制", "每", "天", "计", "划", "六", "件", "事", "情", "依",
            "次", "做", "晚", "上", "小", "结", "中", "层", "管", "理", "者", "要", "落", "实", "以", "下", "事", "情", "一",
            "f", "i", "r", "e", "a", "n", "d", "h", "i", "r", "e", "招", "人", "要", "招", "到", "心", "里", "去", "保", "持",
            "关", "心", "同", "时", "开", "除", "人", "之", "前", "至", "少", "先", "帮", "他", "三", "次", "指", "出", "改",
            "进", "方", "向", "二", "t", "e", "a", "m", "b", "u", "i", "l", "d", "i", "n", "g", "让", "大", "家", "感", "到",
            "工", "作", "开", "心", "g", "e", "t", "r", "e", "s", "u", "l", "t", "人", "事", "合", "一", "关", "注", "整",
            "个", "过", "程", "高", "层", "管", "理", "者", "要", "落", "实", "以", "下", "事", "情", "一", "揪", "头", "发",
            "3", "6", "5", "天", "考", "核", "开", "眼", "界", "二", "照", "镜", "子", "客", "观", "镜", "过", "不", "留",
            "影", "清", "空", "过", "去", "发", "现", "新", "思", "路", "忘", "掉", "过", "去", "不", "带", "情", "绪", "闻",
            "味", "道", "预", "判", "问", "题", "选", "人", "注", "意", "三", "点", "真", "实", "担", "当", "视", "人", "为",
            "人", "在", "进", "行", "三", "板", "斧", "培", "训", "之", "前", "每", "个", "小", "组", "至", "少", "需", "要",
            "回", "答", "以", "下", "几", "个", "问", "题", "1", "你", "们", "为", "什", "么", "要", "做", "这", "个", "事",
            "情", "2", "你", "们", "凭", "什", "么", "可", "以", "做", "这", "个", "事", "情", "3", "这", "个", "事", "情",
            "是", "什", "么", "你", "们", "讲", "得", "清", "楚", "吗", "4", "你", "们", "的", "竞", "争", "分", "析", "是",
            "什", "么", "5", "你", "们", "最", "能", "够", "打", "动", "所", "有", "团", "队", "和", "客", "户", "的", "东",
            "西", "是", "什", "么", "，", "最", "核", "心", "的", "价", "值", "点", "是", "什", "么", "6", "这", "件", "事",
            "情", "真", "地", "达", "成", "统", "一", "了", "吗", "团", "队", "成", "员", "想", "清", "楚", "了", "吗", "或",
            "者", "有", "人", "觉", "得", "这", "个", "事", "情", "还", "没", "有", "想", "清", "楚", "吗", "三", "天", "的",
            "培", "训", "课", "程", "会", "包", "括", "项", "目", "讲", "解", "和", "答", "辩", "第", "一", "天", "重", "点",
            "在", "w", "h", "y", "和", "w", "h", "a", "t", "第", "二", "天", "重", "点", "在", "h", "o", "w", "每", "晚", "r",
            "e", "v", "i", "e", "w", "第", "三", "天", "复", "盘", "团", "队", "人", "组", "织", "成", "长", "课", "程", "本",
            "身", "这", "种", "培", "训", "与", "讲", "课", "有", "很", "大", "区", "讲", "课", "主", "要", "是", "让", "大",
            "家", "了", "解", "新", "思", "想", "新", "案", "例", "和", "方", "向", "如", "同", "开", "天", "眼", "为", "了",
            "建", "立", "团", "队", "信", "任", "阿", "里", "巴", "巴", "会", "经", "常", "组", "织", "破", "冰", "活", "动",
            "称", "为", "裸", "聊", "会", "大", "家", "互", "相", "分", "享", "成", "长", "故", "事", "有", "了", "信", "任",
            "为", "前", "提", "才", "会", "有", "同", "理", "心", "才", "能", "换", "位", "思", "考", "团", "队", "中", "的",
            "人", "可", "分", "为", "三", "种", "一", "种", "是", "火", "种", "能", "够", "影", "响", "别", "人", "一", "种",
            "是", "木", "头", "可", "以", "在", "别", "人", "的", "影", "响", "下", "开", "始", "做", "出", "成", "绩", "还",
            "有", "一", "种", "是", "石", "头", "无", "法", "点", "燃", "只", "能", "直", "接", "用", "项", "目", "雏", "形",
            "要", "考", "虑", "的", "因", "素", "有", "很", "多", "首", "先", "是", "竞", "争", "对", "手", "分", "析", "要",
            "调", "研", "后", "确", "定", "自", "己", "是", "否", "是", "全", "国", "或", "区", "域", "的", "第", "一", "和",
            "唯", "一", "这", "个", "第", "一", "是", "否", "重", "要", "如", "果", "重", "要", "那", "么", "要", "如", "何",
            "维", "持", "和", "保", "持", "形", "成", "特", "色", "化", "和", "差", "异", "化", "第", "二", "如", "果", "要",
            "做", "成", "一", "个", "系", "统", "要", "考", "虑", "这", "个", "系", "统", "中", "最", "关", "键", "的", "要",
            "素", "是", "什", "么", "如", "何", "打", "造", "项", "目", "组", "要", "想", "清", "楚", "要", "点", "问", "自",
            "己", "如", "果", "只", "干", "一", "件", "事", "这", "件", "事", "是", "什", "么", "是", "否", "能", "用", "一",
            "句", "话", "来", "说", "明", "项", "目", "有", "什", "么", "第", "三", "项", "目", "的", "核", "心", "客", "户",
            "是", "哪", "个", "人", "群", "切", "不", "可", "以", "地", "理", "位", "置", "或", "年", "龄", "来", "分", "类",
            "第", "四", "确", "定", "如", "何", "保", "障", "和", "盈", "利", "做", "事", "情", "前", "可", "以", "参", "考",
            "样", "本", "成", "功", "或", "失", "败", "均", "可", "在", "此", "基", "础", "上", "往", "前", "走", "三", "步",
            "，", "也", "是", "很", "好", "的", "不", "一", "定", "要", "重", "新", "搭", "建", "新", "系", "统", "人", "是",
            "很", "重", "要", "的", "因", "素", "这", "需", "要", "详", "细", "的", "数", "据", "人", "在", "哪", "里", "如",
            "何", "连", "这", "三", "个", "要", "素", "很", "关", "键", "人", "是", "互", "联", "网", "竞", "争", "中", "最",
            "核", "心", "的", "点", "产", "品", "的", "竞", "争", "优", "势", "不", "在", "于", "原", "材", "料", "而", "是",
            "其", "功", "能", "要", "为", "消", "费", "者", "解", "构", "出", "应", "用", "场", "景", "产", "品", "其", "实",
            "是", "项", "目", "团", "队", "表", "达", "出", "的", "对", "世", "界", "的", "理", "解", "团", "队", "创", "建",
            "初", "期", "领", "导", "要", "强", "势", "把", "所", "有", "人", "笼", "在", "身", "边", "给", "每", "个", "人",
            "做", "清", "晰", "的", "分", "工", "人", "们", "是", "在", "分", "工", "中", "实", "现", "合", "作", "的", "管",
            "理", "者", "进", "行", "团", "队", "整", "合", "会", "降", "低", "效", "率", "但", "是", "增", "加", "效", "能",
            "管", "者", "要", "时", "刻", "告", "诉", "大", "家", "几", "件", "事", "情", "第", "一", "方", "向", "是", "什",
            "么", "产", "品", "是", "什", "么", "目", "标", "人", "群", "是", "什", "么", "第", "二", "人", "要", "如", "何",
            "分", "工", "第", "三", "资", "源", "例", "如", "钱", "时", "间", "人", "才", "等", "如", "何", "分", "配", "马",
            "云", "的", "人", "哲", "学", "是", "建", "立", "平", "台", "机", "制", "让", "所", "有", "人", "积", "极", "向",
            "上", "地", "往", "前", "走", "指", "明", "动", "力", "讨", "论", "学", "习", "以", "及", "所", "谓", "的", "探",
            "讨", "都", "是", "应", "该", "在", "工", "作", "之", "外", "工", "作", "之", "内", "只", "干", "每", "一", "分",
            "钟", "产", "出", "直", "接", "业", "绩", "的", "东", "西",
        );
    }

    /**
     * 是否需要某一条记录返回空
     * 因为有些数据需要可能为空的 如用户生日  可能就不会填写
     * @return bool
     */
    public function isReturnEmpty()
    {
        return microtime(true) % 2 == 0;
    }

    /**
     * 获取一段随机字符串
     * @param int $length 随机字符串的长度
     * @param int $maxLength 随机字符串的最大长度
     * @param bool $some_empty 是否有几率返回空数据
     * @return string 随机字符串
     */
    public function getStrings($length = 5, $maxLength = 10, $some_empty = false)
    {
        if (empty($length)) return '';
        $string = '';
        $is_empty = $some_empty ? $this->isReturnEmpty() : false;
        $count = $is_empty ? 0 : mt_rand($length, $maxLength);
        for ($i = 0; $i < $count; $i++) {
            $string .= $this->data[mt_rand(0, ($this->dataLength - 1))];
        }
        return $string;
    }


    /**
     * 获取随机图片 并转为json格式
     * @param int $maxCount 需要返回的图片的最大张数
     * @return false|string
     */
    public function getImages($maxCount = 5)
    {
        $images = [];
        $imagesLength = count($this->images);
        $realCount = mt_rand(1, $maxCount);
        for ($i = 0; $i < $realCount; $i++) {
            $images[] = $this->images[mt_rand(0, ($imagesLength - 1))];
        }
        return json_encode($images);
    }

    /**
     * 返回给定的时间区间的随机一个时间
     * @param string $startDate 开始时间
     * @param string $endDate 结束时间
     * @param bool $returnTime 是否需要返回时分秒
     * @return false|string 给定的时间区域中到的一个时间
     */
    public function getRandomDate($startDate = '1980-01-01', $endDate = '1999-12-30', $returnTime = false)
    {
        $randomTime = mt_rand(strtotime($startDate), strtotime($endDate));
        if ($this->isReturnEmpty()) return '0000-00-00';
        return $returnTime ? date("Y-m-d H:i:s", $randomTime) : date("Y-m-d", $randomTime);
    }

    /**
     * 获取随机字符串
     * @param int $length 字符串最短长度
     * @param int $maxLength 字符串最大长度
     * @return string
     */
    public function getRandomStrings($length = 6, $maxLength = 10)
    {
        //字符组合
        $str = 'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789';
        $len = strlen($str) - 1;
        $randstr = '';
        $length = mt_rand($length, $maxLength);
        for ($i = 0; $i < $length; $i++) {
            $num = mt_rand(0, $len);
            $randstr .= $str[$num];
        }
        return $randstr;
    }

    /**
     * 获取随机邮箱字符串
     * @param int $length
     * @return string
     */
    public function getRandomEmail($length = 8)
    {
        return $this->getRandomStrings() . '@' . $this->getRandomStrings(2, 4) . '.' . $this->getRandomStrings(2, 4);
    }
}

